"""
案例：
    演示张量的索引操作
分类：
   简单行索引
   列表索引
   范围索引
   布尔索引
   多维索引
掌握：简单行索引，范围索引，多维索引
"""

#导包
import torch

#1.设置随机种子
torch.manual_seed(24)

#2.创建随机张量
t1=torch.randint(1,10,(5,5))
print(f't1:{t1}')
print('-'*40)

#3.演示张量的索引操作
#3.1 简单行索引
#3.1.1 获取第二行的所有数据
print(t1[1])
print(t1[1,:])
#3.1.2 获取第三列的所有数据
print(t1[:,2])
print('-'*40)

#3.2列表索引
#3.2.1返回（0，1）（1，2）两个位置的元素
print(t1[[0,1],[1,2]])
#3.2.2返回（1，2）（3，4）两个位置的元素
print(t1[[1,3],[2,4]])#前面[1,3]表示行，[2,4]表示列
#3.2.3返第0，1，行的1，2列的四个元素
print(t1[[[0],[1]],[1,2]])
print('-'*40)

#3.3范围索引
#3.3.1返回前3行前2列
print(t1[:3,:2])
#3.3.2返回第2行到最后一行，前两列的数据
print(t1[1:,:2])
#3.2.3所有奇数行，偶数列
print(t1[1::2,0::2])
print('-'*40)
#3.4布尔索引
#3.4.1第三列大于5的行数据
print(t1[t1[:,2]>5])
#3.4.2第2行大于5的列数据
print(t1[:,t1[1]>5])#要列
print('-'*40)
#3.5多维索引
#3.5.1创建3维张量：2个两行三列的矩阵
t2=torch.randint(1,10,(2,3,4))
print(f't2:{t2}')
#3.5.2返回第0轴上的第一个数据
print(t2[0,:,:])#0轴对应第一个矩阵
#3.5.3返回第1轴上的第一个数据
print(t2[:,0,:])#1轴对应矩阵的行
#3.5.4返回第2轴上的第一个数据
print(t2[:,:,0])#2轴对应矩阵的列



print('-'*40)
